SS-Sauron/Bluetooth-Jieli-Research/tools/panel_diag/sdkconfig.defaults
# ── PSRAM — 8 MB octal on ESP32-S3-WROOM-1-N16R8 ─────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# ── Flash — 16 MB N16 variant ─────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ── LVGL port task period (milliseconds) ──────────────────────────────────
CONFIG_ESP_LVGL_PORT_TIMER_PERIOD_MS=5

# ── SPI master — ISR in IRAM for lower latency ────────────────────────────
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# ── Logging ───────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ── Explicit target (prevents chip argument mismatch) ─────────────────────
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
